In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [84]:
df=pd.read_csv("dataset/test.csv")
gender=df['Sex']
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [46]:
df1=pd.read_csv("dataset/train.csv")
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
delete_columns = ['Name', 'PassengerId', 'SibSp', 'Parch', 'Ticket', 'Cabin']
df.drop(delete_columns, axis=1, inplace=True)

In [69]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   Fare      418 non-null    float64
 4   Embarked  418 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 16.5+ KB

In [71]:
#checking non numberical values from the data set
cnt=1
for col in df.columns:
    if(df[col].dtype=='O'):
        print("Unique value {} : {} ".format(col,df[col].unique()))

Unique value Sex : ['male' 'female']
Unique value Embarked : ['Q' 'S' 'C']

In [72]:
my_dict={'Q':0,'S':1,'C':2}
df['Embarked']=df['Embarked'].map(my_dict)
df.head()

   Pclass     Sex   Age     Fare  Embarked
0       3    male  34.5   7.8292         0
1       3  female  47.0   7.0000         1
2       2    male  62.0   9.6875         0
3       3    male  27.0   8.6625         1
4       3  female  22.0  12.2875         1

In [73]:
df=pd.get_dummies(df,drop_first=True)
df.head()

   Pclass   Age     Fare  Embarked  Sex_male
0       3  34.5   7.8292         0         1
1       3  47.0   7.0000         1         0
2       2  62.0   9.6875         0         1
3       3  27.0   8.6625         1         1
4       3  22.0  12.2875         1         0

In [10]:
df.isnull().sum()

Pclass       0
Age         86
Fare         1
Embarked     0
Sex_male     0
dtype: int64

In [33]:
p=df['Age'].mean()
x=df['Age'].replace(np.NaN,p)
y=df['Fare'].replace(np.NaN,df['Fare'].mean())
df['Age'],df['Fare']=x,y

In [13]:
df.isnull().sum()

Pclass       0
Age         86
Fare         1
Embarked     0
Sex_male     0
dtype: int64

train.csv

In [47]:
delete_columns = ['Name', 'PassengerId', 'SibSp', 'Parch', 'Ticket', 'Cabin']
df1.drop(delete_columns, axis=1, inplace=True)

In [48]:
#checking non numberical values from the data set
cnt=1
for col in df1.columns:
    if(df1[col].dtype=='O'):
        print("Unique value {} : {} ".format(col,df1[col].unique()))

Unique value Sex : ['male' 'female']
Unique value Embarked : ['S' 'C' 'Q' nan]

In [87]:
x=df1['Embarked'].fillna(('S'))

In [50]:
df1['Embarked']=x
my_dict={'Q':0,'S':1,'C':2}
df1['Embarked']=df1['Embarked'].map(my_dict)

In [51]:
df1=pd.get_dummies(df1,drop_first=True)
df1.head()

   Survived  Pclass   Age     Fare  Embarked  Sex_male
0         0       3  22.0   7.2500         1         1
1         1       1  38.0  71.2833         2         0
2         1       3  26.0   7.9250         1         0
3         1       1  35.0  53.1000         1         0
4         0       3  35.0   8.0500         1         1

In [53]:
p=df1['Age'].mean()
x=df1['Age'].replace(np.NaN,p)
y=df1['Fare'].replace(np.NaN,df1['Fare'].mean())
df1['Age'],df1['Fare']=x,y

In [54]:
df1.isnull().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Embarked    0
Sex_male    0
dtype: int64

In [55]:
df1.head()

   Survived  Pclass   Age     Fare  Embarked  Sex_male
0         0       3  22.0   7.2500         1         1
1         1       1  38.0  71.2833         2         0
2         1       3  26.0   7.9250         1         0
3         1       1  35.0  53.1000         1         0
4         0       3  35.0   8.0500         1         1

In [74]:
x_test=df.iloc[:,:].values
x_train=df1.iloc[:,1:].values
y_train=df1.iloc[:,0].values

In [75]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(solver='newton-cg',multi_class='ovr')
model.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='ovr', n_jobs=None, penalty='l2',
                   random_state=None, solver='newton-cg', tol=0.0001, verbose=0,
                   warm_start=False)

In [76]:
y_prd=model.predict(x_test)

In [77]:
y_prd

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [86]:
output = pd.DataFrame({'Gender': gender, 'Survived': y_prd})
output.to_csv('Output.csv', index=False)